import pandas as pd
from read_shloka import create_list

from vinyaasa import *


n_shloka = 701

ff = open('pada_table.csv', 'w')

ss = 'श्लोक,'

ll = ['पद ' + str(x+1) for x in range(25)]
ss = ss + ','.join(ll)

ff.write(ss+'\n')

l = 0
for jj in range(n_shloka):

    df = pd.read_csv('pada.csv')
    ll = list(df['पदाः'])
    mm = ll[jj][1:-1].split(', ')

    for ii in range(len(mm)):
        mm[ii] = mm[ii][1:-1]
        if mm[ii] == '':
            del mm[ii]

    s = ','.join(mm)

    s = str(jj+1) + ',' + s

    ff.write(s+'\n')

    print(s)

print(ss)

ff.close()

########################################################################

ff = open('pada_table.md', 'w')

ff.write('# पद-कोष्टक\n\n')

ss = '| श्लोक | '
ll = ['पद ' + str(x+1) for x in range(25)]
ss = ss + ' | '.join(ll)
ff.write(ss+' |\n')

ss = '| '
ll = ['------' for x in range(25)]
ss = ss + ' | '.join(ll)
ff.write(ss+' |\n')

l = 0
for jj in range(n_shloka):

    df = pd.read_csv('pada.csv')
    ll = list(df['पदाः'])
    mm = ll[jj][1:-1].split(', ')

    for ii in range(len(mm)):
        mm[ii] = mm[ii][1:-1]
        if mm[ii] == '':
            del mm[ii]

    del mm[-1]
    ii = mm.index('।')
    del mm[ii]

    mm = [str('[[') + x + str(']]') for x in mm]

    s = ' | '.join(mm)

    s = '| ' + str(jj+1) + ' | ' + s

    ff.write(s+' |\n')

    print(s)

print(ss)

ff.close()

################################################################################

df = pd.read_csv('pada.csv')
shlokas = create_list()
ll = list(df['पदाः'])

for jj in range(n_shloka):

    mm = ll[jj][1:-1].split(', ')

    fin = 'Sandhi/sandhi_summary_' + str(jj+1) + '.csv'
    fout = 'Obsidian/श्लोक_' + str(jj+1) + '.md'

    ff = open(fout, 'w')

    ff.write('# श्लोक ' + str(jj+1) + '\n\n')

    ff.write(shlokas[jj])

    ff.write('\n\n## पद \n\n')

    for ii in range(len(mm)):
        mm[ii] = mm[ii][1:-1]

        if mm[ii] not in ['।', '॥']:
            ff.write('- [[' + mm[ii] + ']]\n')

    ff.write('\n## सन्धि\n\n')

    with open(fin, 'r') as gg:
        w = gg.readlines()
    
    for kk in range(len(w)):

        cc = w[kk][:-1]
        qq = cc.index('-')
        cc = cc[:qq] + cc[qq+1:]
        ff.write('| ' + ' | '.join(cc.split(',')) + ' |\n')
        if kk == 0:
            ff.write('| ----- | ----- | ----- |\n')

    ff.write('\n\n---\n\n#श्लोक')

    print(w)



    # w = gg.readline()
    # ww = w[:-1].split(',')
    # print(ww)

    ff.close()

# print(shlokas)

#################################################################

df = pd.read_csv('pada.csv')
shlokas = create_list()
ll = list(df['पदाः'])

nn = []

for jj in range(n_shloka):

    mm = ll[jj][1:-1].split(', ')

    for ii in range(len(mm)):
        mm[ii] = mm[ii][1:-1]

        if mm[ii] not in ['।', '॥']:
            nn.append(mm[ii])

print(list(dict.fromkeys(nn)))

print(len(nn))

print(len(set(nn)))

def get_anta(x):
    return get_vinyaasa(x)[-1]

def is_in_gana(shabda):
    if shabda in स्वरादि_गण:
        return 'स्वरादि'
    elif shabda in चादि_गण:
        return 'चादि'
    elif shabda in प्रादि_गण:
        return 'प्रादि'
    else:
        return '-'

def occurences(shabda, source=ll):

    r = []
    for ii in range(len(ll)):
        if shabda in ll[ii]:
            r.append(ii)
    return r

def first_occurrence(shabda):
    return min(occurences(shabda)) + 1

df = pd.DataFrame(nn)
df = df.rename(columns={0: 'पद'})
gf = df['पद'].value_counts()

gf = pd.DataFrame(gf)
gf = gf.reset_index()
gf = gf.rename(columns={'index': 'पद', 'पद': 'आवृति'})

स्वरादि_गण = 'स्वर् । अन्तर् । प्रातर् । अन्तोदात्ताः । पुनर् । सनुतर् । उच्चैस् । नीचैस् । शनैस् । ऋधक् । ऋते । युगपत् । आरात् । अन्तिकात् । पृथक् । आद्युदात्ताः । ह्यस् । श्वस् । दिवा । रात्रौ । सायम् । चिरम् । मनाक् । ईषत् । शश्वत् । जोषम् । तूष्णीम् । बहिस् । अधस् । अवस् । समया । निकषा । स्वयम् । मृषा । नक्तम् । नञ् । हेतौ । हे । है । इद्धा । अद्धा । सामि । अन्तोदात्ताः । वत् (गणसूत्रम्) , यथा ब्राह्मणवत्, क्षत्रियवत् । सना । सनत् । सनात् । उपधा । तिरस् । आद्युदात्ताः । अन्तरा । अन्तोदात्ताः । अन्तरेण । मक् । ज्योक् । योक् । नक् । कम् । शम् । सना । सहसा । श्रद्धा । अलम् । स्वधा । वषट् । विना । नाना । स्वस्ति । अन्यत् । अस्ति । उपांशु । क्षमा । विहायसा । दोषा । मृषा । मुधा । दिष्ट्या । वृथा । मिथ्या । क्तवातोसुन्कसुनः (गणसूत्रम्) । कृन्मकारसन्ध्यक्षरान्तोऽव्ययीभावश्च (गणसूत्रम्) । पुरा । मिथो । मिथस् । प्रायस् । मुहुस् । प्रवाहुकम् । प्रवाहिका । आर्यहलम् । अभीक्ष्णम् । सायम् । साकम् । सार्धम् । सार्थम् । सत्रम् । समम् । नमस् । हिरुक् । तसिलादयस्तद्धित एधाच्चपर्यन्ताः (गणसूत्रम्) । शस्तसी, कृत्वसुच्, सुच्, आस्थालौ । च्व्यर्थाश्च (गणसूत्रम्) । अथ । अम् । आम् । प्रताम् । प्रतान् । प्रशान् । तथाहि । मा । माङ् । श्रम् । कामम् । प्रकामम् । भूयस् । परम् । साक्षात् । साचि । सावि । सत्यम् । मंक्षु । संवत् । अवश्यम् । सपदि । प्रादुस् । आविस् । अनिशम् । नित्यम् । नित्यदा । सदा । अजस्रम् । सन्ततम् । उषा । ओम् । भूर् । भुवर् । झटिति । तरसा । सुष्ठु । कु । अञ्जसा । अ । मिथु । अमिथु । विथक् । भाजक् । अन्वक् । चिराय । चिरम् । चिररात्राय । चिरस्य । चिरेण । चिरात् । अस्तम् । आनुषक् । अनुषक् । अनुषट् । अम्नस् । अम्भस् । अम्नर् । अम्भर् । स्थाने । वरम् । दुष्ठु । बलात् । शु । अर्वाक् । शुदि । वदि । इत्यादि । तसिलादयः प्राक्पाशपाः (गणसूत्रम्) । शस्प्रभृतयः प्राक्समासान्तेभ्यः (गणसूत्रम्) । मान्तः कृत्वोर्थः । नानाञौ ॥'
स्वरादि_गण = स्वरादि_गण.split(' । ')
स्वरादि_गण[-1] = स्वरादि_गण[-1][:-2]

चादि_गण = 'च । वा । ह । अह । एव । एवम् । नूनम् । शश्वत् । युगपत् । भूयस् । सूपत् । कूपत् । कुवित् । नेत् । चेत् । चण् । कच्चित् । यत्र । तत्र । नह । हन्त । माकिम् । माकीम् । माकिर् । नकिम् । नकीम् । नकिर् । आकीम् । माङ । नञ् । तावत् । यावत् । त्वा । त्वै । द्वै । न्वै । रै । रे । श्रौषट् । वौषट् । स्वाहा । वषट् । स्वधा । ओम् । तथा । तथाहि । खलु । किल । अथ । सुष्टु । स्म । अ । इ । उ । ऋ । ऌ । उ । ए । ऐ । ओ । औ । आदह । उञ् । उकञ् । वेलायाम् । मात्रायाम् । यथा । यत् । तत् । किम् । पुरा । वधा । वध्वा । धिक् । हाहा । हेहै । हहे । पाट् । प्याट् । आहो । उताहो । हो । अहो । नो । नौ । अथो । ननु । मन्ये । मिथ्या । असि । ब्रूहि । तु । नु । इति । इव । वत् । वात् । वन । बत । सम् । वशम् । शिकम् । दिकम् । सनुकं । छंवट् । छंबट् । शङ्के । शुकम् । खम् । सनात् । सनुतर् । नहिकम् । सत्यम् । ऋतम् । अद्धा । इद्धा । नोचेत् । नचेत् । नहि । जातु । कथम् । कुतः । कुत्र । अव । अनु । हा । हे । है । आहोस्वित् । शम् । कम् । खम् । दिष्ट्या । पशु । नट् । सह । आनुषट् । आनुषक् । अङ्ग । फट् । ताजक् । भाजक् । अये । अरे । वाट् । चाटु । कुम् । खुम् । घुम् । अम् । ईम् । सीम् । सिम् । सि । वै । उपसर्गविभक्तिस्वरप्रतिरूपकाश्च निपाताः ॥'
चादि_गण = चादि_गण.split(' । ')
चादि_गण[-1] = चादि_गण[-1][:-2]

प्रादि_गण = 'प्र । परा । अप । सम् । अनु । अव । निस् । निर् । दुस् । दुर् । वि । आङ् । नि । अधि । अपि । अति । सु । उद् । अभि । प्रति । परि । उप ॥'
प्रादि_गण = प्रादि_गण.split(' । ')
प्रादि_गण[-1] = प्रादि_गण[-1][:-2]

gf['गणपाठ'] = gf['पद'].apply(is_in_gana)
gf['प्रथम श्लोक'] = gf['पद'].apply(first_occurrence)
gf['अन्त'] = gf['पद'].apply(get_anta)

gf.to_csv('pada_list.csv')
print(gf['अन्त'].value_counts())
